# Dotfiles Brewfile — dumped 2026-04-15
# Review and prune before running: brew bundle --file=Brewfile
#
# Install: brew bundle --file=Brewfile
# Check:   brew bundle check --file=Brewfile
# Cleanup: brew bundle cleanup --file=Brewfile (removes unlisted packages)

# --- Taps ---
tap "charmbracelet/tap"
tap "derailed/popeye"
tap "golangci/tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "opencode-ai/tap"
tap "supabase/tap"
tap "wagoodman/dive"

# --- Core CLI tools ---
brew "atuin"
brew "autojump"
brew "bat"
brew "bat-extras"
brew "bottom"
brew "broot"
brew "btop"
brew "carapace"
brew "coreutils"
brew "curl"
brew "difftastic"
brew "direnv"
brew "dive"
brew "docker", link: false
brew "eza"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "git"
brew "glow"
brew "gnupg"
brew "go@1.24", link: true
brew "graphviz"
brew "grep"
brew "gum"
brew "helm"
brew "htop"
brew "hugo"
brew "imagemagick"
brew "jq"
brew "lazygit"
brew "make"
brew "neovim"
brew "node"
brew "nvm"
brew "pass"
brew "pnpm"
brew "ripgrep"
brew "rust"
brew "sesh"
brew "shellcheck"
brew "stern"
brew "superfile"
brew "terminal-notifier"
brew "terraform"
brew "thefuck"
brew "tldr"
brew "tmux"
brew "tree"
brew "uv"
brew "vale"
brew "watch"
brew "wget"
brew "yarn"
brew "yq"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# --- Kubernetes ---
brew "k3d"
brew "k9s"
brew "krew"
brew "derailed/popeye/popeye"
brew "golangci/tap/golangci-lint"

# --- Tap-specific tools ---
brew "charmbracelet/tap/crush"
brew "opencode-ai/tap/opencode"
brew "supabase/tap/supabase"

# --- Casks (GUI apps) ---
cask "1password-cli"
cask "alfred"
cask "chatgpt"
cask "claude-code"
cask "dash"
cask "discord"
cask "docker-desktop"
cask "firefox"
cask "flycut"
cask "fork"
cask "gcloud-cli"
cask "ghostty"
cask "google-chrome"
cask "hammerspoon"
cask "karabiner-elements"
cask "ngrok"
cask "notion"
cask "obsidian"
cask "slack"
cask "spotify"
cask "visual-studio-code"

# --- Fonts ---
cask "font-fira-code"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-mononoki-nerd-font"

# --- VS Code extensions ---
vscode "anthropic.claude-code"
vscode "be5invis.vscode-custom-css"
vscode "biomejs.biome"
vscode "bradlc.vscode-tailwindcss"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "github.codespaces"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "gruntfuggly.todo-tree"
vscode "hashicorp.terraform"
vscode "humao.rest-client"
vscode "mechatroner.rainbow-csv"
vscode "mikestead.dotenv"
vscode "mkhl.direnv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.python"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "redhat.vscode-yaml"
vscode "robbowen.synthwave-vscode"
vscode "shardulm94.trailing-spaces"
vscode "sourcegraph.amp"
vscode "streetsidesoftware.code-spell-checker"
vscode "tamasfe.even-better-toml"
vscode "technosophos.vscode-helm"
vscode "tim-koehler.helm-intellisense"
vscode "vscode-icons-team.vscode-icons"
vscode "yzhang.markdown-all-in-one"
vscode "zxh404.vscode-proto3"

# --- Go tools ---
go "golang.org/x/tools/gopls"
go "honnef.co/go/tools/cmd/staticcheck"

# --- Krew plugins ---
krew "ctx"
krew "ns"
krew "neat"
krew "tail"
krew "blame"
krew "cost"
krew "df-pv"
krew "fuzzy"
krew "images"
krew "ktop"
krew "resource-capacity"
krew "score"
krew "sick-pods"
krew "snap"
krew "view-allocations"
krew "view-utilization"
